#language: ru

Функционал: Ипотека
  @simple @all @success
  Сценарий: Заявка на ипотеку
    Когда Выполнено наведение на Ипотека и выбор Ипотека на готовое жилье
    Тогда выполняется смена фрейма
    Когда Заполняется поле Стоимость недвижимости
    Тогда Делаю лишнюю проверку из за лагающей менюшки
    Тогда Проверяется изменение полей справа 1
    Когда Заполняется поле Первоначальный взнос
    Тогда Проверяется изменение полей справа 2
    Когда Заполняется поле Срок
    Тогда Проверяется изменение полей справа 3
    Когда Выключаю зарплатныю карту Сбербанка
    Тогда Проверяется изменение полей справа 4
    Когда Выключаю возможность подтверждения
    Тогда Проверяется изменение полей справа 5
    Когда Включаю молодую семью
    Тогда Проверяется изменение полей справа 6
    Когда Включаю возможность подтвердить доход
    Тогда Итоговая проверка по всем пунктам справа
